## Plan Result (v3-proxy-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11336372257)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 4 to add, 3 to change, 4 to destroy.</code></pre>

* Update
  * aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
  * aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_route53_record.application_alb_record_8EA9D3F9
* Replace
  * aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_alb.application_application_load_balancer_alb_05EA9801 must be replaced
-/+ resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/v3Prxy2023021323181927470000000d/5b3871332038c996" -> (known after apply)
      ~ arn_suffix                                                   = "app/v3Prxy2023021323181927470000000d/5b3871332038c996" -> (known after apply)
      ~ dns_name                                                     = "internal-v3Prxy2023021323181927470000000d-505888860.us-east-1.elb.amazonaws.com" -> (known after apply)
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/v3Prxy2023021323181927470000000d/5b3871332038c996" -> (known after apply)
      ~ internal                                                     = true -> false # forces replacement
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
      ~ name                                                         = "v3Prxy2023021323181927470000000d" -> (known after apply)
      ~ subnets                                                      = [
          - "subnet-610bdb3b",
          - "subnet-b2a036fa",
          - "subnet-cc66bde0",
          - "subnet-d09eb8ec",
          + "subnet-36c2611d",
          + "subnet-420db61b",
          + "subnet-5a0f952d",
          + "subnet-6b400e51",
        ]
        tags                                                         = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
      ~ vpc_id                                                       = "vpc-867638e3" -> (known after apply)
      ~ zone_id                                                      = "Z35SXDOTRQ7X7K" -> (known after apply)
        # (16 unchanged attributes hidden)

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - subnet_mapping {
          - subnet_id            = "subnet-610bdb3b" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-b2a036fa" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-cc66bde0" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-d09eb8ec" -> null
            # (4 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.application_listener_http_D74EC0ED must be replaced
-/+ resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/49e7d22e6f72dcd5" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/49e7d22e6f72dcd5" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/v3Prxy2023021323181927470000000d/5b3871332038c996" # forces replacement -> (known after apply) # forces replacement
      + ssl_policy        = (known after apply)
        tags              = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
        # (3 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 must be replaced
-/+ resource "aws_alb_listener" "application_listener_https_D31CB055" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/v3Prxy2023021323181927470000000d/5b3871332038c996" # forces replacement -> (known after apply) # forces replacement
        tags              = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F must be replaced
-/+ resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
      ~ arn          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a/81eeeac1dfa69442" -> (known after apply)
      ~ id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a/81eeeac1dfa69442" -> (known after apply)
      ~ listener_arn = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a" # forces replacement -> (known after apply) # forces replacement
        tags         = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
        # (2 unchanged attributes hidden)

      ~ action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0 will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "application_alarm-httptarget5xxerrorrate_F94D87C0" {
        id                                    = "V3ProxyApi-Prod-Alarm-HTTPTarget5xxErrorRate"
        tags                                  = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
        # (22 unchanged attributes hidden)

      - metric_query {
          - id          = "errors" -> null
          - period      = 0 -> null
          - return_data = false -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "LoadBalancer" = "app/v3Prxy2023021323181927470000000d/5b3871332038c996"
                } -> null
              - metric_name = "HTTPCode_Target_5XX_Count" -> null
              - namespace   = "AWS/ApplicationELB" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - id          = "requests" -> null
          - period      = 0 -> null
          - return_data = false -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "LoadBalancer" = "app/v3Prxy2023021323181927470000000d/5b3871332038c996"
                } -> null
              - metric_name = "RequestCount" -> null
              - namespace   = "AWS/ApplicationELB" -> null
              - period      = 300 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - expression  = "errors/requests*100" -> null
          - id          = "expression" -> null
          - label       = "HTTP 5xx Error Rate" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (1 unchanged attribute hidden)
        }
      + metric_query {
          + id          = "errors"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = (known after apply)
              + metric_name = "HTTPCode_Target_5XX_Count"
              + namespace   = "AWS/ApplicationELB"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + id          = "requests"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = (known after apply)
              + metric_name = "RequestCount"
              + namespace   = "AWS/ApplicationELB"
              + period      = 300
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "errors/requests*100"
          + id          = "expression"
          + label       = "HTTP 5xx Error Rate"
          + return_data = true
        }
    }

  # aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247 will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247" {
        id                          = "5d39859c-b825-44c0-8122-7ed7df861051"
        tags                        = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
        # (10 unchanged attributes hidden)

      ~ load_balancer_info {
          ~ target_group_pair_info {
              ~ prod_traffic_route {
                  ~ listener_arns = [
                      - "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/v3Prxy2023021323181927470000000d/5b3871332038c996/48b289a4f5c4a57a",
                    ] -> (known after apply)
                }

                # (2 unchanged blocks hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_route53_record.application_alb_record_8EA9D3F9 will be updated in-place
  ~ resource "aws_route53_record" "application_alb_record_8EA9D3F9" {
        id                               = "Z05649472FMTVD4ZOESQK_v3-proxy-api.readitlater.com_A_1"
        name                             = "v3-proxy-api.readitlater.com"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "internal-v3prxy2023021323181927470000000d-505888860.us-east-1.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "Z35SXDOTRQ7X7K" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":830,"Program":"tfcmt","SHA1":"b55700ab23d63fa536363f13ebef67e58425bc43","Target":"v3-proxy-api-cdk-production","Vars":{},"WorkflowName":"V3 Proxy API"} -->